//	컴퓨터 공학부 202200608 김민준
//  컴퓨터 프로그래밍 과제
//  세계 코로나 감염 현황과 확진자 업데이트,거리두기 단계별 정보

#include <stdio.h>
#include "covid.h"

struct c {
	char land[10];
	int number;
};


int main() {

	
	int a,c,d=0;
	char major[6] = {0};
	char name[4] = { 0 };
	char number[9] = { 0 };
	char* p;
	p = number;
	char b;
	
	static struct c list[] = { { "유럽" , 200 },
	{ "아시아" , 600 },
	{ "아프리카" , 300 },
	{ "남아메리카" , 500 },
	{ "북아메리카" , 400 },
	{ "오세아니아" , 700 } };

	printf("학부를 입력하세요: ");
	scanf("%s", major);
	printf("이름을 입력하세요: ");
	scanf("%s", name);
	printf("학번을 입력하세요: ");
	scanf("%s", number);
	char *infor[] = {
		major , number , name
	};
	for (int i = 0; i < 3 ; i++) {
		printf(" %s", infor[i]);
	}
	printf("님 반갑습니다.\n");
	printf("------------------------------------------------------------------------\n");
	printf(" 1. 세계 코로나 확진자 현황과 확진자 업데이트\n 2. 영어버전 거리두기 단계별 정보\n 3. 프로그램 종료 \n");
	printf("------------------------------------------------------------------------\n");

        printf("원하시는 항목의 번호를 입력해주세요: ");
		scanf("%d", &a);
		if (a == 1) {
			printf("------------------------------------------------------------------------\n");
			for (int i = 0 ; i < 6; i++) {
				printf(" %d.%s    %d\n", i+1,list[i].land, list[i].number);
			}
			printf("------------------------------------------------------------------------\n");
			printf("확진자 정보를 업데이트 하시겠습니까?( y or n ) : ");
			scanf("%s", &b);
			if (b == 'y') {
				while (d != 7) {
					printf("업데이트할 지역의 번호를 입력해주세요(끝내시려면 7을 입력 해 주세요): ");
					scanf("%d", &c);
					printf("업데이트할 숫자를 입력해주세요: ");
					scanf("%d", &d);
					plus(c, d);
				}
			}
			printf("프로그램을 종료합니다\n");
		}
		else if (a == 2) {
			printf("------------------------------------------------------------------------\n");
			open(1);
			printf("------------------------------------------------------------------------\n");
			printf("프로그램을 종료합니다\n"); 
		}
			
		else if (a == 3)
			printf("프로그램을 종료합니다.\n");
			


}

